// Задача 44: Не используя рекурсию, выведите первые N чисел Фибоначчи. Первые два числа Фибоначчи: 0 и 1.
// Если N = 5 -> 0 1 1 2 3
// Если N = 3 -> 0 1 1
// Если N = 7 -> 0 1 1 2 3 5 8

System.Console.Write("Введите количество знаков фибоначи => ");
int n = Convert.ToInt32(Console.ReadLine());
int n1 = 0;
int n2 = 1;
Console.Write("Фибоначи => 0 1 ");

for (int i = 0; n > 2; n--) 
{
    i = n1 + n2;
    Console.Write($"{i} ");
    n1 = n2;
    n2 = i;
}
